; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_2 ?v5 ?v12)
             (pred_3 ?v6 ?v10)
             (pred_6 ?v5 ?v10)
             (pred_7 ?v4 ?v5 )
	     (pred_8 ?v5)
             (pred_5 ?v1)
             (pred_11 ?v6)
             (pred_10 ?v10)
             (pred_12 ?v5)
             (pred_1 ?v6)
             (pred_4 ?v5)
             (pred_9 ))



(:action op_5
:parameters (?v8 ?v13 ?v3 ?v9)
:precondition (and (pred_5 ?v8) (pred_5 ?v13) (pred_11 ?v3) (pred_10 ?v9)
          (pred_2 ?v8 ?v13) (pred_3 ?v3 ?v9)
                   (pred_6 ?v13 ?v9) (pred_8 ?v8) 
                   (pred_12 ?v13) (pred_1 ?v3))
:effect (and  (pred_4 ?v13) (not (pred_12 ?v13))))


(:action op_1
:parameters (?v8 ?v7)
:precondition (and (pred_5 ?v8) (pred_5 ?v7)
               (pred_8 ?v8) (pred_2 ?v8 ?v7) (pred_4 ?v7))
:effect (and (pred_8 ?v7) (not (pred_8 ?v8))))

(:action op_2
:parameters (?v8 ?v3)
:precondition (and (pred_5 ?v8) (pred_11 ?v3) 
                  (pred_8 ?v8) (pred_7 ?v3 ?v8) (pred_9 ))
:effect (and (pred_1 ?v3)
   (not (pred_7 ?v3 ?v8)) (not (pred_9 ))))


(:action op_3
:parameters (?v8 ?v11 ?v2)
:precondition (and (pred_5 ?v8) (pred_11 ?v11) (pred_11 ?v2)
                  (pred_8 ?v8) (pred_1 ?v2) (pred_7 ?v11 ?v8))
:effect (and (pred_1 ?v11) (pred_7 ?v2 ?v8)
        (not (pred_1 ?v2)) (not (pred_7 ?v11 ?v8))))

(:action op_4
:parameters (?v8 ?v3)
:precondition (and (pred_5 ?v8) (pred_11 ?v3) 
                  (pred_8 ?v8) (pred_1 ?v3))
:effect (and (pred_9 ) (pred_7 ?v3 ?v8) (not (pred_1 ?v3)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_16 obj_07 obj_13 obj_12 obj_15 obj_10 obj_01 obj_03 obj_14 obj_02 obj_04 obj_06 obj_21 obj_17 obj_20 obj_05
    obj_08 obj_11
    obj_19 obj_09 obj_18
    )

    (:init
       (pred_9)

       (pred_5 obj_16)
       (pred_5 obj_07)
       (pred_5 obj_13)
       (pred_5 obj_12)
       (pred_5 obj_15)
       (pred_5 obj_10)
       (pred_5 obj_01)
       (pred_5 obj_03)
       (pred_5 obj_14)
       (pred_5 obj_02)
       (pred_5 obj_04)
       (pred_5 obj_06)
       (pred_5 obj_21)
       (pred_5 obj_17)
       (pred_5 obj_20)
       (pred_5 obj_05)
       (pred_10 obj_08)
       (pred_10 obj_11)
       (pred_11 obj_19)
       (pred_11 obj_09)
       (pred_11 obj_18)

       (pred_2 obj_16 obj_15)
       (pred_2 obj_16 obj_07)
       (pred_2 obj_07 obj_10)
       (pred_2 obj_07 obj_13)
       (pred_2 obj_07 obj_16)
       (pred_2 obj_13 obj_01)
       (pred_2 obj_13 obj_12)
       (pred_2 obj_13 obj_07)
       (pred_2 obj_12 obj_03)
       (pred_2 obj_12 obj_13)
       (pred_2 obj_15 obj_14)
       (pred_2 obj_15 obj_10)
       (pred_2 obj_15 obj_16)
       (pred_2 obj_10 obj_02)
       (pred_2 obj_10 obj_01)
       (pred_2 obj_10 obj_07)
       (pred_2 obj_10 obj_15)
       (pred_2 obj_01 obj_04)
       (pred_2 obj_01 obj_03)
       (pred_2 obj_01 obj_13)
       (pred_2 obj_01 obj_10)
       (pred_2 obj_03 obj_06)
       (pred_2 obj_03 obj_12)
       (pred_2 obj_03 obj_01)
       (pred_2 obj_14 obj_21)
       (pred_2 obj_14 obj_02)
       (pred_2 obj_14 obj_15)
       (pred_2 obj_02 obj_17)
       (pred_2 obj_02 obj_04)
       (pred_2 obj_02 obj_10)
       (pred_2 obj_02 obj_14)
       (pred_2 obj_04 obj_20)
       (pred_2 obj_04 obj_06)
       (pred_2 obj_04 obj_01)
       (pred_2 obj_04 obj_02)
       (pred_2 obj_06 obj_05)
       (pred_2 obj_06 obj_03)
       (pred_2 obj_06 obj_04)
       (pred_2 obj_21 obj_17)
       (pred_2 obj_21 obj_14)
       (pred_2 obj_17 obj_20)
       (pred_2 obj_17 obj_02)
       (pred_2 obj_17 obj_21)
       (pred_2 obj_20 obj_05)
       (pred_2 obj_20 obj_04)
       (pred_2 obj_20 obj_17)
       (pred_2 obj_05 obj_06)
       (pred_2 obj_05 obj_20)
       (pred_12 obj_01)
       (pred_12 obj_03)
       (pred_12 obj_04)
       (pred_6  obj_01 obj_08)
       (pred_6  obj_03 obj_11)
       (pred_6  obj_04 obj_11)
       (pred_4 obj_16)
       (pred_4 obj_07)
       (pred_4 obj_13)
       (pred_4 obj_12)
       (pred_4 obj_15)
       (pred_4 obj_10)
       (pred_4 obj_14)
       (pred_4 obj_02)
       (pred_4 obj_06)
       (pred_4 obj_21)
       (pred_4 obj_17)
       (pred_4 obj_20)
       (pred_4 obj_05)

       (pred_3  obj_19 obj_08)
       (pred_3  obj_09 obj_11)
       (pred_3  obj_18 obj_11)
       (pred_7 obj_19 obj_05)
       (pred_7 obj_09 obj_10)
       (pred_7 obj_18 obj_17)
       (pred_8 obj_20)
    )

    (:goal (and
       (pred_7 obj_18 obj_07)
    ))
(:constraints
  (always (not (pred_8 obj_02)))
)
)

; plan
1. (op_1 obj_20 obj_17)
   deleted: (pred_8 obj_20)
   added: (pred_8 obj_17)
   goals met: 0 of 1
2. (op_2 obj_17 obj_18)
   deleted: (pred_7 obj_18 obj_17) (pred_9)
   added: (pred_1 obj_18)
   goals met: 0 of 1
3. (op_1 obj_17 obj_21)
   deleted: (pred_8 obj_17)
   added: (pred_8 obj_21)
   goals met: 0 of 1
4. (op_1 obj_21 obj_14)
   deleted: (pred_8 obj_21)
   added: (pred_8 obj_14)
   goals met: 0 of 1
5. (op_1 obj_14 obj_15)
   deleted: (pred_8 obj_14)
   added: (pred_8 obj_15)
   goals met: 0 of 1
6. (op_1 obj_15 obj_16)
   deleted: (pred_8 obj_15)
   added: (pred_8 obj_16)
   goals met: 0 of 1
7. (op_1 obj_16 obj_07)
   deleted: (pred_8 obj_16)
   added: (pred_8 obj_07)
   goals met: 0 of 1
8. (op_4 obj_07 obj_18)
   deleted: (pred_1 obj_18)
   added: (pred_9) (pred_7 obj_18 obj_07)
   goals met: 1 of 1
